{
  "backend/main.mo": "Motoko backend managing user profiles and workshop registrations with access control, duplicate checks, and admin export APIs.",
  "feature_evidence.json": "Feature evidence report mapping UI features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main landing page layout with hero, form section, feature highlights, and integrated social-proof popups.",
  "frontend/src/components/RegistrationForm.tsx": "Registration form with validation, backend mutation, duplicate handling, and automatic WhatsApp redirect after success.",
  "frontend/src/components/SocialProofPopups.tsx": "Displays timed social-proof popups using shuffled names, random cities, and intervals while persisting shown names in storage.",
  "frontend/src/components/WhatsAppFloatingButton.tsx": "Renders a floating button that opens a WhatsApp group invite link in a new tab.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and managing login/logout flows via AuthClient.",
  "frontend/src/hooks/useRegisterMutation.ts": "Defines a registration mutation using the backend actor with error normalization and query invalidation on success.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines custom light/dark mode color variables for the app theme.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/socialProofConfig.ts": "Contains configuration for social-proof popups including timing, storage, names, cities, and display options.",
  "frontend/src/utils/socialProofState.ts": "Implements state utilities for social-proof popups, including shuffling names, storage handling, and random value generators.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing) and persisting them in sessionStorage, plus utilities for clearing stored or hash-based params.",
  "frontend/src/utils/validation.ts": "Contains simple validators for full name, email, and Indian WhatsApp numbers with normalization and error reporting.",
  "frontend/src/utils/whatsappRedirect.ts": "Attempts to redirect users to a WhatsApp URL, trying top-level navigation first and falling back to the current window.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes current project state, including FOMO trust indicator and social-proof popup features, with requirements and implementation notes."
}